

export const weightText = {
  0: '你的体重偏低,建议每周进行3-4次循序渐进的力量练习,在训练后保证足量碳水和蛋白质的摄入。平时可以多吃坚果牛肉干等富含蛋白质的零食,保证每天多摄入300-600千卡的热量,直至达到目标体重。',
  1: '你的体重标准,体重过轻和过重都不利于身体健康。通过合理运动和营养干预可以使体重保持在理想范围,从而获得更好看、更健康的身材。',
  2: '你的体重偏高,体重过重会给心脏和骨骼系统带来额外的负荷,导致体力下降、身体磨损、慢性疾病风险增加等一系列问题。减重建议：每周进行4-5次,每次45-60分钟的中低强度锻炼。锻炼时可先进行15-20分钟的力量练习,然后再进行30-45分钟的有氧练习,这样可以使燃脂效率更高。饮食上减少500-1000千卡的热量摄入,同时注意合理搭配营养成分。以杂粮、谷薯等富含膳食纤维的食物为主食,搭配鱼虾、鸡蛋、瘦肉类等低脂高蛋白食物,同时注意摄入多种蔬菜水果,组成低热量、高营养、强饱腹感的膳食结构。',
}
export const bmiText = {
  0: 'BMI = 体重(kg)/身高(m)²,BMI又称身体质量指数,在一定程度上可以反映人的胖瘦情况,适宜的BMI是保持健康和好身材的前提。',
}

export const pbfText = {
  0: '你的脂肪率偏低,肌肉线条较明显。脂肪率即脂肪重量占体重的百分比,男性脂肪率达到12-14%、女性脂肪率达到20-22%,就能看到较明显的肌肉线条。脂肪率过低可能会引起内分泌失调,建议男性脂肪率不能低于3%,女性不能低于14%。',
  1: '脂肪率即脂肪重量占体重的百分比,男性脂肪率达到12-14%,女性脂肪率达到20-22%,就能看到较明显的肌肉线条。健走、慢跑、骑行、游泳等长时间中低强度的运动、可以有效燃烧脂肪降低脂肪率。同时配合力量练习,增强肌肉,就可以拥有更明显的肌肉线条。',
  2: '你的脂肪率偏高,可能会导致肥胖以及增加肥胖类疾病的患病风险,长时间的中低强度运动具有良好减脂效果,搭配循序渐进的力量训练和HIIT高强度间歇训练可以保持肌肉增加基础代谢率,使燃脂效率更佳。饮食上以杂粮、谷薯类等主食,组合搭配鱼虾、鸡蛋、瘦肉类低脂高蛋白食物,配合各种蔬菜水果,组成低热量、高营养、强饱腹感的膳食结构。',
  3: '你的脂肪率超高,可能会导致肥胖以及增加肥胖类疾病的患病风险。长时间的中低强度运动具有良好减脂效果,搭配循序渐进的力量训练和HIIT高强度间歇训练可以保持肌肉增加基础代谢率,使燃脂效率更佳。饮食上以杂粮、谷薯类等主食,组合搭配鱼虾、鸡蛋、瘦肉类低脂高蛋白食物,配合各种蔬菜水果,组成低热量、高营养、强饱腹感的膳食结构。'
}
export const muscleText = {
  0: '你的肌肉量偏低,会导致运动能力不足,还会引起基础代谢变慢。节食和过快的降体重会引起肌肉的流失。增肌建议:每周进行2-3次的力量练习,可以刺激肌肉生长。饮食上注意保证碳水和优质蛋白质的摄入,促进糖原恢复和肌肉合成,保证好睡眠时间和质量,让肌肉有足够的时间完成修复。',
  1: '你的肌肉量标准,肌肉量可以反映一个人的力量水平,肌肉量越高的人,基础代谢越高,越不容易发胖。增肌需满足三个条件:一是肌肉受到足够强度的刺激;二是有多余的热量,尤其需要有足够的蛋白质用于肌肉合成;三是要保证睡眠质量,睡眠时生长激素分泌处于高峰,有助于肌肉的修复与生长。',
  2: '你的肌肉量理想,肌肉量可以反映一个人的力量水平,肌肉量越高的人,基础代谢越高,越不容易发胖。增肌需满足三个条件:一是肌肉受到足够强度的刺激;二是有多余的热量,尤其需要有足够的蛋白质用于肌肉合成;三是要保证睡眠质量,睡眠时生长激素分泌处于高峰,有助于肌肉的修复与生长。',
}

export const basalMetabolismText = {
  0: '你的基础代谢偏低,稍微多吃就容易发胖,可能会出现减重时的平台期及反弹。基础代谢指的是人在不进行脑力与体力活动时所消耗的热量。改善基础代谢的方法包括早睡早起、吃好早餐、多喝水、进行力量练习。增加身体的肌肉含量,是提升基础代谢率的秘密武器。',
  1: '你的基础代谢理想,只要不多吃就可以轻松保持体重啦。基础代谢指的是人不进行脑力与体力活动时消耗的热量。提升基础代谢的方法包括调整作息早睡早起、吃好早餐、多喝水,进行力量训练增加身体的肌肉含量是提升基础代谢率的秘密武器。',
}

export const visceralFatText = {
  0: '你的内脏脂肪等级理想,保持理想的内脏脂肪水平,有助于降低脂肪肝、高血压、高血脂、2型糖尿病等慢性疾病的患病风险。内脏脂肪等级反映内脏脂肪的堆积程度,腹部脂肪过多与内脏脂肪等级高密切相关。',
  1: '你的内脏脂肪等级偏高,可能会导致脂肪肝、高血压、高血脂、2型糖尿病等慢性疾病的患病风险增加。内脏脂肪指数反映内脏脂肪的堆积程度,腹部脂肪过多与内脏脂肪等级高密切相关。建议你控制酒精、甜食、油炸等垃圾食品的摄入,每周保持4-5次中低强度的有氧运动,降低全身脂肪含量,改善代谢和胰岛素敏感性,使内脏脂肪恢复到良好状态。',
  2: '你的内脏脂肪等级超高,可能会导致脂肪肝、高血压、高血脂、2型糖尿病等慢性疾病的患病风险增加。内脏脂肪指数反映内脏脂肪的堆积程度,腹部脂肪过多与内脏脂肪等级高密切相关。建议你控制酒精、甜食、油炸等垃圾食品的摄入,每周保持4-5次中低强度的有氧运动,降低全身脂肪含量,改善代谢和胰岛素敏感性,使内脏脂肪恢复到良好状态。'
}

export const waterText = {
  0: '你的水分率偏低,由于人体大部分新陈代谢活动都在体液中进行,所以缺水会影响身体机能的正常运作,导致新陈代谢缓慢、加快身体老化。平时要记得多喝水,运动时出汗丢失体液,要记得少量多次及时补水哦。',
  1: '你的水分率标准,规律的饮食和每天八杯水就可以继续保持理想的身体水分含量啦。水分率指的是人体水分占体重的百分比。充足的水分可以促进新陈代谢,保持皮肤年轻。运动出汗、体液丢失时,要记得少量、多次地及时补充水分和电解质。',
  2: '你的水分率理想,规律的饮食和每天八杯水就可以继续保持理想的身体水分含量啦。水分率指的是人体水分占体重的百分比。充足的水分可以促进新陈代谢,保持皮肤年轻。运动出汗、体液丢失时,要记得少量、多次地及时补充水分和电解质。'
}
export const boneText = {
  0: '你的骨量偏低,容易引发腰酸背疼的情况,同时骨质疏松的风险也可能增加。骨量指的是钙、磷等无机盐在体内的含量。多晒太阳、补充维生素D、从牛奶、豆制品、鱼、动物骨头中摄取钙质,经常参加体育运动都可以让骨骼变的更强壮。',
  1: '你的骨量理想，请继续保持均衡的饮食和适当的锻炼。骨量指的是钙、磷等无机盐在体内的含量，多晒太阳、补充维生素D，从牛奶、豆制品、鱼、动物骨头中摄取钙质，经常参加体育运动都可以让骨骼变的更强壮。'
}
export const proteinText = {
  0: '你的蛋白质含量过低,缺乏蛋白质会导致免疫力低下、肌肉瘦弱无力、贫血等。蛋白质是身体的重要组成部分,可以从肉、鱼、奶、蛋等食物中获取丰富的蛋白质,来保持健康和增加肌肉。',
  1: '你的蛋白质含量标准,蛋白质是身体的重要组成部分,有助于增强身体免疫力。平时可以从肉、鱼、奶、蛋等食物中获取丰富的蛋白质,来保持健康和增加肌肉。',
  2: '你的蛋白质含量理想,蛋白质是身体的重要组成部分,有助于增强身体免疫力。平时可以从肉、鱼、奶、蛋等食物中获取丰富的蛋白质,来保持健康和增加肌肉。'
}

export const ageOffsetText = {
  0: '很棒,你的身体年龄比真实年龄年轻。身体年龄是通过身体水分和基础代谢综合评估得出。随着年龄的增长,身体水分和基础代谢会逐渐下降。积极锻炼、保持健康饮食和生活方式,可以使身体看起来更年轻。',
  1: '身体年龄是通过身体水分和基础代谢综合评估得出。随着年龄的增长,身体水分和基础代谢会逐渐下降。积极锻炼、保持健康饮食和生活方式,可以使身体看起来更年轻。',
}



